ITE311-ALCAYDE/app/Controllers/AdminUserController.php

SELECT *
FROM `users`
---
    public function index()
// This defines the index method, which is typically the default method called when accessing the controller.

    {
// This is the opening brace for the index method.

        if (!session()->get('LoggedIn') || session()->get('user_role') !== 'admin') {
// This checks if the user is not logged in or if their role is not 'admin'; if true, access is denied.

        return redirect()->to(base_url('login'))->with('error', 'Access denied.');
// This redirects the user to the login page with an error message if access is denied.

    }
// This is the closing brace for the if statement.

    $data['users'] = $this->userModel->findAll();

INSERT INTO `users` (`name`, `email`, `role`, `status`, `password`, `created_at`, `updated_at`) VALUES ('Kiara Sei', 'johnlloydalcayde870@gmail.com', 'admin', 'restricted', '$2y$10$PhrMZZzJcp3E9Clj47ErDuUaXOYESscU8WI7M5XhgxJ712MNwq3JK', '2025-12-09 04:32:52', '2025-12-09 04:32:52')
---
                // Attempt to insert the new user data into the database
                // This is a comment explaining the insertion attempt.

                $insertBatch = \Config\Database::connect()->table('users')->insert($newUser);

SELECT *
FROM `users`
WHERE `email` = 'johnlloydalcayde870@gmail.com'
---
                   $email = $this->request->getPost('email');

                     $db = Database::connect();
                     $user = $db->table('users')->where('email', $email)->get()->getRow();

INSERT INTO `validations` (`email`, `validation_link`, `created_at`, `status`) VALUES ('johnlloydalcayde870@gmail.com', 'http://localhost/ITE311-ALCAYDE/verify_account/8', '2025-12-09 04:32:52', 'unused')
---
                    $db->table('validations')
                    ->where('created_at <', date('Y-m-d H:i:s', strtotime('-3 minutes')))
                    ->delete();
                      $db->table('validations')->insert([
                    'email' => $email,
                    'validation_link'   => $link,
                    'created_at' =>  date('Y-m-d H:i:s'),
                    'status' => 'unused',
                ]);

UPDATE `users` SET `status` = 'granted'
WHERE `id` = '8'
UPDATE `users` SET `status` = 'granted', `updated_at` = '2025-12-09 04:33:16'
WHERE `users`.`id` IN ('8')
---
    public function verifyAccount($id)
    {
        $db = Database::connect();
        $user = $db->table('users')->where('id', $id)->update(['status' => 'granted']);


        if (!$user) {
            return redirect()->to(base_url('login'))->with('error', 'Invalid verification link.');
        }

        // Update user status to 'granted' upon verification
        $this->userModel->update($id, ['status' => 'granted']);