ITE311-ALCAYDE/app/Controllers/AdminUserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        if (!session()->get('LoggedIn') || session()->get('user_role') !== 'admin') {
        return redirect()->to(base_url('login'))->with('error', 'Access denied.');
    }

    $data['users'] = $this->userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    public function toggleRestriction($id)
    {
        $user = $this->userModel->find($id);