ITE311-ALCAYDE/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
---
            $db   = Database::connect();
// Connects to database.

            $user = $db->table('users')->where('email', $email)->get()->getRow();

SELECT *
FROM `verifications`
WHERE `verification_code` = '628591'
---
    public function getCode() {
        $session = session();
        helper(['form']);
        $data = [];
        $code    = $this->request->getPost('code');
        $rules = [
        'code' => [
                'label'  => 'Code',
                'rules'  => 'required|numeric',
                'errors' => [
                'numeric' => 'The {field} must contain only numbers.',
                ]
            ],
        ];

        if (! $this->validate($rules)) {
                $data['validation'] = $this->validator;
                return view('auth/forgot_password', $data);
         }

         $db = Database::connect();
         $user = $db->table('verifications')->where('verification_code', $code)->get()->getRow();

UPDATE `verifications` SET `status` = 'used'
WHERE `verification_code` = '628591'
---
            $session->setFlashdata('error', 'This code has already been used.');
            return redirect()->back()->withInput();
        }
        $db->table('verifications')->where('verification_code', $code)->update([
            'status' => 'used',
        ]);