ITE311-ALCAYDE/app/Controllers/Course.php

        // ✅ 4. Get all available courses
// This is a comment indicating the retrieval of all courses.

        $allCourses = $courseModel->findAll();
---
SELECT *
FROM `courses`