ITE311-ALCAYDE/app/Controllers/Course.php

    public function studentCourses() {
       $session = session();

        // ✅ 1. Check if user is logged in
        if (!$session->has('user_id')) {
            return redirect()->to('/login')->with('error', 'Please log in first.');
        }

        $user_id = $session->get('user_id');

        // ✅ 2. Load models
        $enrollmentModel = new EnrollmentModel();
        $courseModel     = new courseModel();

        // ✅ 3. Get enrolled courses (joined with course names)
        $enrollments = $enrollmentModel->getUserEnrollments($user_id);

        // ✅ 4. Get all available courses
        $allCourses = $courseModel->findAll();
---
SELECT *
FROM `courses`