ITE311-ALCAYDE/app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrolled_date`) VALUES ('3', '5', '2025-11-11 14:31:23')
---
    public function enrollUser(array $data)
    {
        // Optional: prevent duplicate enrollment before inserting
        if ($this->isAlreadyEnrolled($data['user_id'], $data['course_id'])) {
            return false;
        }

        // If 'enrolled_date' is not set, use current timestamp
        if (!isset($data['enrolled_date'])) {
            $data['enrolled_date'] = date('Y-m-d H:i:s');
        }

        return $this->insert($data);

SELECT `courses`.`id`, `courses`.`course_name`, `courses`.`course_instructor`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = 3
---
    public function getUserEnrollments(int $user_id)
    {
        return $this->select('courses.id, courses.course_name,
                                courses.course_instructor')
                ->join('courses', 'courses.id = enrollments.course_id')
                ->where('enrollments.user_id', $user_id)
                ->findAll();

SELECT *
FROM `enrollments`
WHERE `user_id` = 3
AND `course_id` = 5
 LIMIT 1
---
    public function isAlreadyEnrolled(int $user_id, int $course_id)
    {
        $enrollment = $this->where([
            'user_id'   => $user_id,
            'course_id' => $course_id,
        ])->first();