ITE311-ALCAYDE/app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrolled_date`) VALUES ('3', '17', '2025-12-13 09:04:50')
---
    public function enrollUser(array $data)
// This defines the enrollUser method, which takes an array of data to enroll a user in a course.

    {
// This is the opening brace for the enrollUser method.

        // Optional: prevent duplicate enrollment before inserting
// This is a comment explaining the optional check to prevent duplicate enrollments.

        if ($this->isAlreadyEnrolled($data['user_id'], $data['course_id'])) {
// This checks if the user is already enrolled in the course using the isAlreadyEnrolled method.

            return false;
// This returns false if already enrolled, preventing duplicate insertion.

        }
// This is the closing brace for the if statement.

        // If 'enrolled_date' is not set, use current timestamp
// This is a comment explaining the setting of the enrolled_date if not provided.

        if (!isset($data['enrolled_date'])) {
// This checks if 'enrolled_date' is not set in the data array.

            $data['enrolled_date'] = date('Y-m-d H:i:s');
// This sets the 'enrolled_date' to the current date and time if not provided.

        }
// This is the closing brace for the if statement.

        return $this->insert($data);

SELECT *
FROM `enrollments`
WHERE `user_id` = 3
AND `course_id` = 17
 LIMIT 1
---
    public function isAlreadyEnrolled(int $user_id, int $course_id)
// This defines the isAlreadyEnrolled method, which checks if a user is enrolled in a course.

    {
// This is the opening brace for the isAlreadyEnrolled method.

        $enrollment = $this->where([
// This starts a query to find an enrollment record matching the user_id and course_id.

            'user_id'   => $user_id,
// This specifies the user_id condition.

            'course_id' => $course_id,
// This specifies the course_id condition.

        ])->first();